EA/src/Catalogs/Контракты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Контракты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ДержателиКонтракта</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтракта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШкалаБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыПлановКонтрактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Catalogs/Контракты/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ДатаОкончания < ДатаНачала Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Дата окончания не должна быть меньше даты начала.'"), Ссылка, "ДатаОкончания", "Объект", Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Родитель);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Контракты.ДатаНачала,
		|	Контракты.ДатаОкончания
		|ИЗ
		|	Справочник.Контракты КАК Контракты
		|ГДЕ
		|	Контракты.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Если ДатаНачала < Выборка.ДатаНачала ИЛИ ДатаНачала >= Выборка.ДатаОкончания
			ИЛИ ДатаОкончания <= Выборка.ДатаНачала ИЛИ ДатаОкончания > Выборка.ДатаОкончания Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Период плана контракта должен быть в пределах периода контракта.'"), Ссылка, "ДатаНачала", "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Родитель") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Родитель);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Контракты.Владелец,
		|	Контракты.ТипКонтракта,
		|	Контракты.ШкалаБюджета,
		|	Контракты.УчитыватьНДС
		|ИЗ
		|	Справочник.Контракты КАК Контракты
		|ГДЕ
		|	Контракты.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
